In [ ]:
#Mercedes Arantza Juárez Cerecedo

In [1]:
import pandas as pd
import numpy as np

In [ ]:
def ex1_concat_same_structure():
    """Ejercicio 1:
    Crea dos DataFrame que compartan la misma estructura de columnas (por ejemplo,
    'Nombre' y 'Edad'), con al menos 3 filas cada uno. Concaténalos verticalmente
    en un único DataFrame. Retorna el DataFrame resultante.
    """
    pass

In [17]:
def ex1_concat_same_structure():
    df1 =pd.DataFrame({'Nombre':['Pao',' Pau', 'Soff'],
                      'Edad':[21,20,23]
        })
    df2 = pd.DataFrame({'Nombre':['Maff','Maquita','Anita'],
                       'Edad': [19,21,22]
        })
    df_final = pd.concat([df1, df2], ignore_index= True)
    return df_final

In [18]:
ex1_concat_same_structure()

    Nombre  Edad
0      Pao    21
1      Pau    20
2     Soff    23
3     Maff    19
4  Maquita    21
5    Anita    22

In [ ]:
def ex2_concat_with_month_column():
    """Ejercicio 2:
    Tienes un DataFrame con ventas de enero y otro con ventas de febrero (mismas columnas).
    Concaténalos en un solo DataFrame y añade una columna que indique el mes original
    de cada fila (por ejemplo: 'Enero' o 'Febrero'). Retorna el DataFrame resultante.
    """
    pass

In [41]:
def ex2_concat_with_month_column():
     df_enero = pd.DataFrame({'Venta':[80,140, 92],'Mes':['Enero']*3})
     df_febrero = pd.DataFrame({'Venta':[45,154,56],'Mes':['Febrero']*3})
     df_final = pd.concat([df_enero, df_febrero], ignore_index= True)
     return df_final

In [42]:
ex2_concat_with_month_column()

   Venta      Mes
0     80    Enero
1    140    Enero
2     92    Enero
3     45  Febrero
4    154  Febrero
5     56  Febrero

In [ ]:
def ex3_concat_diff_columns_fillna():
    """Ejercicio 3:
    Crea dos DataFrame que no tengan exactamente las mismas columnas (ej.: uno tiene
    'Producto' y 'Ventas', el otro 'Producto' y 'Descuento'). Concaténalos y asegura
    que los valores faltantes queden rellenados con 0. Retorna el DataFrame resultante.
    """
    pass

In [49]:
def ex3_concat_diff_columns_fillna():
     df_ventas =pd.DataFrame({'Producto':['Estufa','Lavadora'],
                      'Ventas':[136,66,]
        })
     df_descuento = pd.DataFrame({'Producto':['Impresora', 'Licuadora','Televisión'],
                       'Descuento': [25,15,10 ]
        })
     df_final = pd.concat([df_ventas, df_descuento], ignore_index= True)

     df_final=df_final.fillna(0)
     return df_final

In [50]:
ex3_concat_diff_columns_fillna()

     Producto  Ventas  Descuento
0      Estufa   136.0        0.0
1    Lavadora    66.0        0.0
2   Impresora     0.0       25.0
3   Licuadora     0.0       15.0
4  Televisión     0.0       10.0

In [51]:
def ex4_concat_three_groups():
    """Ejercicio 4:
    Genera tres DataFrame pequeños (cada uno con, por ejemplo, 3 filas) que representen
    notas de distintos grupos de alumnos. Concaténalos verticalmente en un solo DataFrame
    que contenga todas las notas. Retorna el DataFrame resultante.
    """
    pass

In [63]:
def ex4_concat_three_groups():
     df_grupo1 =pd.DataFrame({'Alumno':['Pao','Pau', 'Maff'],
                      'Ingles':[5,5.5,6],
                      'Matematicas':[8,7.2,7]
        })
     df_grupo2 = pd.DataFrame({'Alumno':['Ana','James', 'Harry'],
                      'Ingles':[9.5,10,10],
                      'Matematicas':[6,8,7.6]
        })
     df_grupo3 =pd.DataFrame({'Alumno':['Max','Carlos', 'Soff'],
                      'Ingles':[10,5,7.9],
                      'Matematicas':[10,5.8,8]
        })
     df_final = pd.concat([df_grupo1, df_grupo2,df_grupo3], ignore_index= True)
     return df_final

In [64]:
ex4_concat_three_groups()

   Alumno  Ingles  Matematicas
0     Pao     5.0          8.0
1     Pau     5.5          7.2
2    Maff     6.0          7.0
3     Ana     9.5          6.0
4   James    10.0          8.0
5   Harry    10.0          7.6
6     Max    10.0         10.0
7  Carlos     5.0          5.8
8    Soff     7.9          8.0

In [ ]:
def ex5_remove_duplicates_preserve_order(lst):
    """Ejercicio 5:
    Dada una lista de enteros (o strings) que puede contener duplicados, devuelve una
    nueva lista sin duplicados preservando el orden original. No uses directamente set()
    para eliminar duplicados (escribe la lógica que preserve el orden). Retorna la nueva 
    lista sin duplicados.
    """
    pass

In [70]:
def ex5_remove_duplicates_preserve_order(lst):
    resultado=[]
    for item in lst:
     if item not in resultado:
        resultado.append(item)
    return resultado

In [72]:
lst=(1,2,3,4,5,2,3,4)
ex5_remove_duplicates_preserve_order(lst)

[1, 2, 3, 4, 5]

In [ ]:
def ex6_sort_tuples_by_second_element(tuples_list):
    """Ejercicio 6:
    Dada una lista de tuplas, por ejemplo [("a", 3), ("b", 1), ("c", 2)], ordénala
    por el segundo elemento de cada tupla y devuelve la lista ordenada. Usa una función
    anónima si lo deseas. Retorna la lista ordenada.
    """
    pass

In [75]:
def ex6_sort_tuples_by_second_element(tuples_list):
    lista_ordenada = sorted (tuples_list, key=lambda x:x[1])
    return lista_ordenada

In [79]:
tuples_list=([("a", 3), ("b", 1), ("c", 2)])
ex6_sort_tuples_by_second_element(tuples_list)

[('b', 1), ('c', 2), ('a', 3)]

In [ ]:
def ex7_first_n_multiples_of_7(n):
    """Ejercicio 7:
    Devuelve una lista con los primeros n múltiplos de 7 (por ejemplo, n=5 -> [7,14,21,28,35]).
    Retorna la lista generada.
    """
    pass

In [86]:
def ex7_first_n_multiples_of_7(n):
    multiplos=[]
    for i in range (1,n+1):
        multiplos.append(7*i)
    return multiplos

In [90]:
ex7_first_n_multiples_of_7(5)

[7, 14, 21, 28, 35]

In [ ]:
def ex8_filter_palindromes(strings):
    """Ejercicio 8:
    Dada una lista de cadenas, devuelve sólo aquellas que son palíndromos (se leen igual
    al derecho y al revés). Retorna una lista con los palíndromos encontrados.
    """
    pass

In [91]:
def ex8_filter_palindromes(strings):
    palindromos=[]
    for s in strings:
        if s == s[::-1]:
            palindromos.append(s)
    return palindromos

In [93]:
strings=["reconocer", "lobo", "ana", "oso","vestido"]
ex8_filter_palindromes(strings)

['reconocer', 'ana', 'oso']

In [ ]:
def ex9_set_intersection_and_difference(set_a, set_b):
    """Ejercicio 9:
    Dado dos conjuntos, devuelve su intersección y la diferencia (elementos de A que no
    están en B). Retorna una tupla (intersección, diferencia).
    """
    pass

In [98]:
def ex9_set_intersection_and_difference(set_a, set_b):
    interseccion = set_a & set_b
    diferencia = set_a - set_b
    return (interseccion, diferencia)

In [102]:
set_a={1,2,3,4}
set_b={2,7,4,9}
ex9_set_intersection_and_difference(set_a, set_b)

({2, 4}, {1, 3})

In [ ]:
def ex10_is_subset(set_a, set_b):
    """Ejercicio 10:
    Verifica si set_a es subconjunto de set_b. Devuelve True o False.
    """
    pass

In [103]:
def ex10_is_subset(set_a, set_b):
    return set_a.issubset(set_b)

In [105]:
ex10_is_subset(set_a, set_b)

False

In [ ]:
def ex11_count_unique_elements(lst):
    """Ejercicio 11:
    Dada una lista, cuenta cuántos elementos únicos contiene (usa set para obtener el conteo).
    Retorna el número de elementos únicos.
    """
    pass

In [106]:
def ex11_count_unique_elements(lst):
    elementos_unicos= set(lst)
    return len(elementos_unicos)

In [107]:
lst=[1,2,3,4,3,2,2,3]
ex11_count_unique_elements(lst)

4

In [ ]:
def ex12_unique_words_from_phrases(phrases):
    """Ejercicio 12:
    Dada una lista de frases (strings), extrae y devuelve el conjunto de todas las palabras
    únicas que aparecen en todas las frases. Retorna un conjunto con las palabras únicas.
    """
    pass

In [116]:
def ex12_unique_words_from_phrases(phrases):
    palabras_unicas = set()
    for frase in phrases:
     palabras=frase.split()
     palabras_unicas.update(palabras)
    return palabras_unicas

In [117]:
phrases = ["tengo hambre", "tengo sueño", "no sueño"]
ex12_unique_words_from_phrases(phrases)

{'hambre', 'no', 'sueño', 'tengo'}

In [ ]:
def ex13_oldest_person(tuple_list):
    """Ejercicio 13:
    Recibe una lista de tuplas (nombre, edad). Devuelve la tupla de la persona con mayor edad.
    """
    pass

In [121]:
def ex13_oldest_person(tuple_list):
   if not tuple_list:
    return None 
   return max(tuple_list, key = lambda x:x[1])

In [123]:
tuple_list = [("James",25), ("Harry", 30), ("Dylan", 34)]
ex13_oldest_person(tuple_list)

('Dylan', 34)

In [ ]:
def ex14_convert_list_of_lists_to_tuples(list_of_lists):
    """Ejercicio 14:
    Convierte una lista de listas en una lista de tuplas. Retorna la nueva lista de tuplas.
    """
    pass

In [124]:
def ex14_convert_list_of_lists_to_tuples(list_of_lists):
    return [tuple(sublista) for sublista in list_of_lists]

In [125]:
list_of_lists = [[ 1,2],[6,7,8],[9,10]]
ex14_convert_list_of_lists_to_tuples(list_of_lists)

[(1, 2), (6, 7, 8), (9, 10)]

In [ ]:
def ex15_sum_of_tuple_abc(t):
    """Ejercicio 15:
    Recibe una tupla de tres números (a, b, c). Desempaquétala y devuelve la suma a+b+c. 
    Retorna un número entero o flotante.
    """
    pass

In [127]:
def ex15_sum_of_tuple_abc(t):
    a,b,c = t
    return a+b+c

In [131]:
t=[1,2,3]
ex15_sum_of_tuple_abc(t)

6

In [ ]:
def ex16_sort_product_price(prod_price_list):
    """Ejercicio 16:
    Dada una lista de tuplas (producto, precio), ordénala por precio de menor a mayor.
    Retorna la lista ordenada.
    """
    pass

In [132]:
def ex16_sort_product_price(prod_price_list):
    return sorted(prod_price_list, key = lambda x:x[1])

In [134]:
prod_price_list=[("libro", 384),("Juguete carro", 74),("Muñeca",60)]
ex16_sort_product_price(prod_price_list)

[('Muñeca', 60), ('Juguete carro', 74), ('libro', 384)]

In [ ]:
def ex17_char_frequency(s):
    """Ejercicio 17:
    Cuenta la frecuencia de cada carácter en una cadena usando un diccionario.
    Retorna un diccionario {carácter: frecuencia}.
    """
    pass

In [152]:
def ex17_char_frequency(s):
    frecuencia = {}
    for char in s:
        if char in frecuencia:
            frecuencia[char] += 1
        else:
            frecuencia[char] = 1
    return frecuencia

In [155]:
s="cucaracha"
ex17_char_frequency(s)

{'c': 3, 'u': 1, 'a': 3, 'r': 1, 'h': 1}

In [ ]:
def ex18_best_student(grades_dict):
    """Ejercicio 18:
    Dado un diccionario {alumno: calificación}, devuelve al mejor estudiante.
    Retorna una tupla (nombre, calificación).
    """
    pass

In [166]:
def ex18_best_student(grades_dict):
    mejor_nota= max(grades_dict.items(), key=lambda x:x[1])
    return mejor_nota

In [167]:
grades_dict = {"Johny": 8.5, "Lando": 9.2, "Ran": 7.8, "Julio": 9.5}
ex18_best_student(grades_dict)

('Julio', 9.5)

In [ ]:
def ex19_invert_dictionary(d):
    """Ejercicio 19:
    Invierte un diccionario, intercambiando claves y valores.
    Retorna el diccionario invertido.
    """
    pass

In [168]:
def ex19_invert_dictionary(d):
    dicc_invertido = {valor: clave for clave, valor in d.items()}
    return dicc_invertido

In [170]:
d={"gato":5, "perro":2,"león":3,"tigre":4}
ex19_invert_dictionary(d)

{5: 'gato', 2: 'perro', 3: 'león', 4: 'tigre'}

In [ ]:
def ex20_merge_dicts_sum_values(d1, d2):
    """Ejercicio 20:
    Fusiona dos diccionarios sumando los valores de las claves que se repitan. 
    Devuelve el diccionario resultante.
    """
    pass

In [171]:
def ex20_merge_dicts_sum_values(d1, d2):
    resultado= d1.copy()
    for clave, valor in d2.items():
        resultado[clave] = resultado.get(clave,0)+valor
    return resultado

In [173]:
d1={"a":3,"f":7,"j":9}
d2={"a":8,"j":5,"r":2}
ex20_merge_dicts_sum_values(d1, d2)

{'a': 11, 'f': 7, 'j': 14, 'r': 2}

In [ ]:
def ex21_numpy_array_set_fifth():
    """Ejercicio 21:
    Crea un arreglo de NumPy de 10 ceros y cambia el quinto elemento (índice 4) a 1.
    Retorna el array resultante.
    """
    pass

In [174]:
def ex21_numpy_array_set_fifth():
    arreglo=np.zeros(10)
    arreglo[4] =1
    return arreglo

In [175]:
ex21_numpy_array_set_fifth()

array([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.])

In [ ]:
def ex22_numpy_matrix_3x3():
    """Ejercicio 22:
    Genera una matriz 3x3 con los valores del 0 al 8. 
    Retorna la matriz como array de NumPy.
    """
    pass

In [186]:
def ex22_numpy_matrix_3x3():
    matriz = np.arange(9).reshape(3, 3)
    return matriz

In [187]:
ex22_numpy_matrix_3x3()

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [ ]:
def ex23_numpy_statistics():
    """Ejercicio 23:
    Genera un array aleatorio de 20 enteros y calcula la media, mediana y desviación estándar.
    Retorna una tupla (media, mediana, desviación estándar).
    """
    pass

In [193]:
def ex23_numpy_statistics():
    array_al=np.random.randint(0,100,20)
    media=np.mean(array_al)
    mediana=np.median(array_al)
    desviacion=np.std(array_al)
    return (media, mediana, desviacion)

In [194]:
 ex23_numpy_statistics()

(np.float64(60.25), np.float64(67.5), np.float64(26.626819186677178))

In [ ]:
def ex24_numpy_clip_values(arr):
    """Ejercicio 24:
    Dado un array (o lista) de números, reemplaza todos los valores mayores que 10 por 10
    (es decir, limita/"clip" los valores máximos).
    Retorna el array modificado.
    """
    pass

In [195]:
def ex24_numpy_clip_values(arr):
    arr=np.array(arr)
    arr=np.clip(arr,None,10)
    return arr

In [197]:
arr=[3,4,5,14,16,10]
ex24_numpy_clip_values(arr)

array([ 3,  4,  5, 10, 10, 10])

In [ ]:
def ex25_filter_rows_age_over_30():
    """Ejercicio 25:
    Crea un DataFrame con columnas 'Nombre', 'Edad' y 'Ciudad'.
    Filtra y retorna solo las filas con `Edad` > 30.
    """
    pass

In [216]:
def ex25_filter_rows_age_over_30():
    df = pd.DataFrame({
        'Nombre': ['Pao', 'Pau', 'Soff', 'Luis', 'Ana'],
        'Edad': [21, 20, 23, 35, 40],
        'Ciudad': ["Qro", "Jerez", "Orizaba", "CDMX", "Monterrey"]
    })
    df_filtrado = df[df['Edad']>30]
    return df_filtrado

In [217]:
ex25_filter_rows_age_over_30()

  Nombre  Edad     Ciudad
3   Luis    35       CDMX
4    Ana    40  Monterrey

In [ ]:
def ex26_load_dict_into_dataframe_and_sort():
    """Ejercicio 26:
    Carga un diccionario en un DataFrame (por ejemplo {'Nombre': [...], 'Puntaje': [...]})
    y ordénalo por la columna de puntaje de mayor a menor.
    Retorna el DataFrame ordenado.
    """
    pass

In [218]:
def ex26_load_dict_into_dataframe_and_sort():
    return pd.DataFrame({'Nombre':['Pao', 'Pau', 'Soff', 'Luis', 'Ana'],
                         'Puntaje':[90,90,68,64,45]}).sort_values(by='Puntaje',ascending=False)

In [219]:
ex26_load_dict_into_dataframe_and_sort()

  Nombre  Puntaje
0    Pao       90
1    Pau       90
2   Soff       68
3   Luis       64
4    Ana       45

In [ ]:
def ex27_groupby_mean_value():
    """Ejercicio 27:
    Dado un DataFrame con columnas 'Grupo' y 'Valor', calcula el promedio de 'Valor'
    por cada 'Grupo' usando groupby. 
    Retorna el DataFrame agrupado con promedios.
    """
    pass

In [220]:
def ex27_groupby_mean_value():
    df = pd.DataFrame({
        'Grupo': ['A', 'B', 'A', 'B', 'C', 'A'],
        'Valor': [10, 20, 30, 40, 50, 60]
    })
    df_promedio = df.groupby('Grupo', as_index=False)['Valor'].mean()
    return df_promedio

In [221]:
ex27_groupby_mean_value()

  Grupo      Valor
0     A  33.333333
1     B  30.000000
2     C  50.000000

In [ ]:
def ex28_most_sold_product_from_sales_df():
    """Ejercicio 28:
    Dado un DataFrame de ventas con columnas 'Producto' y 'Cantidad', determina cuál
    es el producto con la mayor suma total de 'Cantidad' (es decir, el más vendido).
    Retorna una tupla (Producto, Ventas).
    """
    pass

In [223]:
def ex28_most_sold_product_from_sales_df():
    df = pd.DataFrame({
        'Producto': ['A', 'B', 'A', 'B', 'C', 'A'],
        'Cantidad': [45, 86, 14, 40, 56, 61]
    })
    ventas_totales = df.groupby('Producto')['Cantidad'].sum()
    producto_max = ventas_totales.idxmax()
    cantidad_max = ventas_totales.max()
    
    return (producto_max, cantidad_max)
    return df_promedio

In [224]:
ex28_most_sold_product_from_sales_df()

('B', np.int64(126))

In [ ]:
def ex29_map_lambda_cube(lst):
    """Ejercicio 29:
    Usa map junto con una función lambda para elevar al cubo cada número en una lista.
    Devuelve la lista resultante.
    """
    pass

In [226]:
def ex29_map_lambda_cube(lst):
    return list(map(lambda x: x**3, lst))

In [228]:
lst=[2,4,6]
ex29_map_lambda_cube(lst)

[8, 64, 216]

In [ ]:
def ex30_filter_lambda_even(lst):
    """Ejercicio 30:
    Usa filter y una lambda para quedarte sólo con los números pares de una lista.
    Devuelve la lista filtrada.
    """
    pass

In [229]:
def ex30_filter_lambda_even(lst):
    return list(filter(lambda x:x % 2 == 0, lst))

In [231]:
lst =[1,2,4,5,7,11]
ex30_filter_lambda_even(lst)

[2, 4]

In [ ]:
def ex31_sort_list_of_dicts_by_key(lst, keyname):
    """Ejercicio 31:
    Dada una lista de diccionarios, ordénala por el valor asociado a 'keyname' usando
    sorted con una lambda. Devuelve la lista ordenada.
    """
    pass

In [234]:
def ex31_sort_list_of_dicts_by_key(lst, keyname):
 return sorted (lst, key=lambda d: d[keyname])

In [244]:
def ex31_sort_list_of_dicts_by_key(lst, keyname):
    return sorted(lst, key=lambda d: d[keyname])

In [247]:
lst = [
    {'nombre': 'Pao', 'edad': 19},
    {'nombre': 'Pau', 'edad': 20},
    {'nombre': 'Ana', 'edad': 22}
]
resultado = ex31_sort_list_of_dicts_by_key(lst, 'edad')
print(resultado)

[{'nombre': 'Pao', 'edad': 19}, {'nombre': 'Pau', 'edad': 20}, {'nombre': 'Ana', 'edad': 22}]

In [ ]:
def ex32_pandas_apply_lambda_uppercase(names_list):
    """Ejercicio 32:
    Crea un DataFrame con una columna 'Nombre' a partir de names_list y usa apply con
    una función lambda para crear una nueva columna con los nombres en mayúsculas.
    Devuelve el DataFrame modificado.
    """
    pass

In [238]:
def ex32_pandas_apply_lambda_uppercase(names_list):
    df = pd.DataFrame({'Nombre': names_list})
    df['Nombre_Mayus'] = df['Nombre'].apply(lambda x: x.upper())
    return df

In [241]:
names_list=['Pao','Pau','Ana']
ex32_pandas_apply_lambda_uppercase(names_list)

  Nombre Nombre_Mayus
0    Pao          PAO
1    Pau          PAU
2    Ana          ANA